{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "tech_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "tech_input"}, "inbound_nodes": []}, {"name": "lstm_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 5], "dtype": "float32", "sparse": false, "name": "lstm_input"}, "inbound_nodes": []}, {"name": "tech_dense_0", "class_name": "Dense", "config": {"name": "tech_dense_0", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["tech_input", 0, 0, {}]]]}, {"name": "lstm_0", "class_name": "LSTM", "config": {"name": "lstm_0", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["lstm_input", 0, 0, {}]]]}, {"name": "tech_relu_0", "class_name": "Activation", "config": {"name": "tech_relu_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["tech_dense_0", 0, 0, {}]]]}, {"name": "lstm_dropout_0", "class_name": "Dropout", "config": {"name": "lstm_dropout_0", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_0", 0, 0, {}]]]}, {"name": "tech_dropout_0", "class_name": "Dropout", "config": {"name": "tech_dropout_0", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["tech_relu_0", 0, 0, {}]]]}, {"name": "concatenate", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lstm_dropout_0", 0, 0, {}], ["tech_dropout_0", 0, 0, {}]]]}, {"name": "dense_pooling", "class_name": "Dense", "config": {"name": "dense_pooling", "trainable": true, "dtype": "float32", "units": 64, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "dense_out", "class_name": "Dense", "config": {"name": "dense_out", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_pooling", 0, 0, {}]]]}], "input_layers": [["lstm_input", 0, 0], ["tech_input", 0, 0]], "output_layers": [["dense_out", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"learning_rate": 0.0005000000237487257, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "mse", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_out/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "dense_out/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_pooling/kernel", "shape": [70, 64], "dtype": "float32"}, {"name": "dense_pooling/bias", "shape": [64], "dtype": "float32"}, {"name": "lstm_0/kernel", "shape": [5, 200], "dtype": "float32"}, {"name": "lstm_0/recurrent_kernel", "shape": [50, 200], "dtype": "float32"}, {"name": "lstm_0/bias", "shape": [200], "dtype": "float32"}, {"name": "tech_dense_0/kernel", "shape": [1, 20], "dtype": "float32"}, {"name": "tech_dense_0/bias", "shape": [20], "dtype": "float32"}]}]}